naizhao/Pilot-Kit-Box-ESP32-P4/firmware/sdkconfig.defaults
# Pilot Kit Box (ESP32-P4) default sdkconfig.
# Generated to capture only the non-default settings the project requires.
# Run `idf.py menuconfig` to override; this file seeds a fresh sdkconfig.

# --- Target -----------------------------------------------------------------
CONFIG_IDF_TARGET="esp32p4"

# --- Pilot Kit Box features -------------------------------------------------
# BLE is on by default — flashing the C6 esp_hosted slave firmware is a
# one-time per-board setup step (see docs/BUILD.md §3). If you haven't
# done that step yet (or you're a CI runner without C6 access), set
# this to n via `idf.py menuconfig` before building.
CONFIG_PK_BLE_ENABLED=y

# --- ESP32-P4 silicon revision ---------------------------------------------
# IDF v6.0 defaults to P4 ECO5 (v3.1+). The Waveshare ESP32-P4-WIFI6 boards
# in our supply chain still ship with the original v1.x silicon (one of
# our test boards reports v1.3), so the bootloader refuses to start until
# we opt into the v0.x/v1.x family. Hardware revisions ≥ 3.0 are NOT
# binary-compatible with this build — if a v3.x P4 ever shows up we'll
# have to ship a second sdkconfig variant.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# --- External PSRAM (32 MB stacked HEX, on-die with ESP32-P4NRW32) ----------
# The ESP32-P4NRW32 chip on the Waveshare board ships with 32 MiB of
# in-package HEX (16-line) PSRAM. ESP-IDF defaults to PSRAM disabled, so
# without these knobs the firmware only has ~455 KiB of internal SRAM —
# not enough to bring up ESP-Hosted's SDIO mempool, NimBLE, the IQ ring
# buffer and the LCD framebuffer at the same time.
#
# We:
#   - turn on PSRAM in HEX mode at 200 MHz (v1.x silicon doesn't allow
#     250 MHz; the option is hidden by ESP32P4_SELECTS_REV_LESS_V3),
#   - route plain malloc() into PSRAM for any allocation > 16 KiB so
#     small DMA-sensitive buffers stay in internal RAM, and
#   - reserve 64 KiB of internal RAM for the things that absolutely
#     need it (USB/SDIO DMA descriptors, BLE controller scratch).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Allow EXT_RAM_BSS_ATTR-tagged statics (PFD/BLE scratch tables) to land
# in PSRAM. Without this, those ~10 KiB of large static arrays sit in
# internal RAM .bss and starve ESP-Hosted's early-boot mempools + the
# FreeRTOS timer task stack alloc.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# --- USB Host stack ---------------------------------------------------------
# RTL-SDR dongles enumerate a single device but some ship via a hub bridge.
CONFIG_USB_HOST_HUBS_SUPPORTED=y
# Increase the control-transfer descriptor cap so we can read RTL2832U's
# config/string descriptors without short reads.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=512

# --- FreeRTOS ---------------------------------------------------------------
# 2 MSPS bursts need responsive ISR/event handling.
CONFIG_FREERTOS_HZ=1000

# --- Logging ----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Memory -----------------------------------------------------------------
# RTL-SDR async pipeline holds 15 x 6.4 KiB = ~96 KiB of in-flight URBs in
# DMA-capable internal RAM. Keep the main task stack modest, give the
# heap room to breathe.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# --- Compiler ---------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y

# --- Bluetooth (NimBLE host over ESP-Hosted VHCI) ---------------------------
# ESP32-P4 has no native BT controller; the controller lives on the on-board
# ESP32-C6 and is exposed to the P4 over SDIO via ESP-Hosted. From NimBLE's
# point of view this is a VHCI controller with no UART or SPI knobs to set.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
# We act as GATT *server* for our app-facing characteristics, but also as
# GATT *client* toward iOS's Current Time Service after each connect.
# NimBLE compiles in ble_gattc_* only when ROLE_CENTRAL is enabled; the
# role flag is just a code-gate, we never actively scan or initiate
# connections.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
# Bump MTU so a single GDL90 Traffic Report (≤62 B) fits in one ATT PDU.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
# Default NimBLE transport for a "controller disabled" host is the H4 UART
# bound to a couple of fixed GPIOs (4/5 at 921600). We don't have a real
# UART HCI — the BT controller lives on the C6 and the HCI rides over
# ESP-Hosted's SDIO VHCI shim instead. Turn UART off so NimBLE picks up
# the hosted VHCI transport that esp_hosted's BT support installs.
CONFIG_BT_NIMBLE_TRANSPORT_UART=n

# --- ESP-Hosted (P4 ↔ C6 transport for BT/Wi-Fi remote) ---------------------
# Waveshare ESP32-P4-WIFI6 wires C6 via SDIO slot 1 on these GPIOs:
#   CLK=18 CMD=19 D0=14 D1=15 D2=16 D3=17 RESET=54
# None of the upstream P4 dev-board presets match, so we run with NONE and
# set the pins explicitly. Wi-Fi remote stays off — Phase 3b is BLE only.
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
# Waveshare ESP32-P4-WIFI6 (and the related P4-Nano) routes P4-GPIO54
# through an inverter/level-shifter before it reaches C6's EN pin, so
# from the P4's point of view the reset signal is ACTIVE-HIGH: driving
# GPIO54 HIGH asserts reset, driving it LOW releases. This is the
# opposite of the C6 silicon polarity and the opposite of what the
# ESP32-P4-Function-EV-Board uses. The clue came from ESPHome user
# `sobiso` (github.com/esphome/esphome#10393 — same C6 pins as us)
# whose working YAML uses `active_high: true`, which their adapter
# translates exactly to CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y.
# With our previous ACTIVE_LOW setting we were holding C6 in reset
# right after the P4 boot reset pulse, hence the 0x107 CMD5 failures.
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y

# Shrink ESP-Hosted's per-bus packet pools. Defaults are 20×1536 B per
# direction, which becomes ~47 KiB of DMA-capable internal RAM per
# pool — and on the v1.x P4 with the early-boot heap fragmentation
# pattern we get, the second pool fails to find a 64-byte-aligned
# contiguous block. 8 deep queues are still plenty for BLE-only
# traffic (we don't use Wi-Fi remote), and the pool footprint drops
# to ~29 KiB which fits comfortably.
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=8
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=8

# --- Flash & Partitions -----------------------------------------------------
# Waveshare ESP32-P4-WIFI6 ships 32 MB on-board Nor flash. Use the full chip
# size and our custom partition table that reserves a 16 MiB LittleFS volume
# for ADS-B ts-format dump files.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
